Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::PortBase Class Reference
MEP Element Manager
The Port is associated to an element and it represents a point between elements. More...
#include <MEPPortBase.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PortBase:
 Public Member Functions
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsConnected () const
Result< bool >  | IsConnectable (const UniqueID &portId) const
Checks if the Port is connectable to another Port which has the UniqueID of the parameter.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetWidth (double width)
Sets the width of the port.
void  | SetHeight (double height)
Sets the height of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Protected Member Functions
PortBase (std::shared_ptr< Impl::IPortBaseImpl >)
Modifier (PortBase &)
Detailed Description
The Port is associated to an element and it represents a point between elements.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 Reporter portReporter;
 portReporter.Add ("Ports:");
 portReporter.SetTabCount (1);
 for (const UniqueID& portID : mepElem.GetPortIDs ()) {
 portReporter.SetTabCount (1);
 Port::Get (portID).Then ([&](const Port& port) {
 portReporter.Add ("Port name", port.GetName ());
 portReporter.Add ("Port width", port.GetWidth ());
 portReporter.Add ("Port height", port.GetHeight ());
 portReporter.Add ("Port position", port.GetPosition ());
 portReporter.Add ("Port domain", port.GetDomain ());
 portReporter.Add ("Port shape", port.GetShape ());
 portReporter.Add ("Port Orientation - direction vector", port.GetOrientation ().direction);
 portReporter.Add ("Port Orientation - rotation vector", port.GetOrientation ().rotation);
 portReporter.Add ("Port MEP System", port.GetMEPSystem ());
 port.IsConnected () ? portReporter.Add ("Port is connected with another port.") : portReporter.Add ("Port is not connected with another port.");
 if (port.IsConnected ()) {
 Port::Get (*port.GetConnectedPortId ()).Then ([&](const Port& port) {
 portReporter.Add ("Connected port's name", port.GetName ());
 });
 portReporter.Add ("Details about connected element:");
 portReporter.SetTabCount (2);
 Element::Get (*port.GetConnectedMEPElementId ()).Then ([&](const Element& element) {
 Orientation orientation = element.GetOrientation ();
 portReporter.Add ("Id", element.GetElemId ());
 portReporter.Add ("Anchor point", element.GetAnchorPoint ());
 portReporter.Add ("Orientation - direction vector", orientation.direction);
 portReporter.Add ("Orientation - rotation vector", orientation.rotation);
 });
 }
 });
 VentilationPort::Get (portID).Then ([&](const VentilationPort& port) {
 portReporter.Add ("Port wall thickness", port.GetWallThickness ());
 });
 PipingPort::Get (portID).Then ([&](const PipingPort& port) {
 portReporter.Add ("Port wall thickness", port.GetWallThickness ());
 portReporter.Add ("Port diameter", port.GetOuterDiameter ());
 });
 portReporter.Add ("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -");
 }
 portReporter.Write ();
 Modification
 ACAPI::Result<Element> mepElem = Element::Get (id);
 if (mepElem.IsErr ()) {
 ACAPI_WriteReport (mepElem.UnwrapErr ().text.c_str (), false);
 return mepElem.UnwrapErr ().kind;
 }
 for (const UniqueID& portID : mepElem->GetPortIDs ()) {
 ACAPI::Result<Port> port = Port::Get (portID);
 ACAPI::Result<void> modifyPortResult = (*port).Modify ([&portID](Port::Modifier& modifier) {
 modifier.SetShape (ConnectorShape::Circular);
 modifier.SetWidth (0.7);
 ACAPI::Result<VentilationPort> ventilationPort = VentilationPort::Get (portID);
 if (ventilationPort.IsOk ()) {
 ventilationPort->Modify ([](VentilationPort::Modifier& modifier) {
 modifier.SetWallThickness (0.004);
 }, "Ventilation port modification.");
 }
 ACAPI::Result<PipingPort> pipingPort = PipingPort::Get (portID);
 if (pipingPort.IsOk ()) {
 pipingPort->Modify ([](PipingPort::Modifier& modifier) {
 modifier.SetWallThickness (0.008);
 modifier.SetOuterDiameter (0.1);
 }, "Piping port modification.");
 }
 }, "Port properties modified.");
 if (modifyPortResult.IsErr ())
 return modifyPortResult.UnwrapErr ().kind;
 }
 return NoError;
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::v1::PortBase::Exists  |  ( |   | ) |   const
Returns
Checks if the Port still exists.
◆ GetConnectedMEPElementId()
 std::optional< UniqueID > ACAPI::MEP::v1::PortBase::GetConnectedMEPElementId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the connected MEP element, if there is any.
◆ GetConnectedPortId()
 std::optional< UniqueID > ACAPI::MEP::v1::PortBase::GetConnectedPortId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the connected port, if there is any.
◆ GetDomain()
 Domain ACAPI::MEP::v1::PortBase::GetDomain  |  ( |   | ) |   const
The domain of the port can differ from the domain of the element that it belongs to, for ex. in case of Equipments.
Returns
Returns the domain of the Port.
◆ GetHeight()
 double ACAPI::MEP::v1::PortBase::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the Port.
◆ GetMEPElementId()
 UniqueID ACAPI::MEP::v1::PortBase::GetMEPElementId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the MEP element it belongs to.
◆ GetMEPSystem()
 API_AttributeIndex ACAPI::MEP::v1::PortBase::GetMEPSystem  |  ( |   | ) |   const
Returns
Returns the AttributeIndex of the MEPSystem attribute to which it belongs.
◆ GetName()
 GS::UniString ACAPI::MEP::v1::PortBase::GetName  |  ( |   | ) |   const
Returns
Returns the name of the port which you would see on the user interface.
◆ GetOrientation()
 Orientation ACAPI::MEP::v1::PortBase::GetOrientation  |  ( |   | ) |   const
Returns
Returns the orientation of the Port, which is based on a direction vector and a rotation vector.
◆ GetPosition()
 API_Coord3D ACAPI::MEP::v1::PortBase::GetPosition  |  ( |   | ) |   const
Returns
Returns the middle point of the Port.
◆ GetShape()
 ConnectorShape ACAPI::MEP::v1::PortBase::GetShape  |  ( |   | ) |   const
Returns
Returns the shape of the Port.
◆ GetWidth()
 double ACAPI::MEP::v1::PortBase::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the Port.
◆ IsConnectable()
 Result< bool > ACAPI::MEP::v1::PortBase::IsConnectable  |  ( |  const UniqueID &  |  portId | ) |   const
Checks if the Port is connectable to another Port which has the UniqueID of the parameter.
Parameters
portId | The UniqueID of the port to check against.
Returns
Returns an error if the parameter does not identify a Port, otherwise the result of the check.
◆ IsConnected()
 bool ACAPI::MEP::v1::PortBase::IsConnected  |  ( |   | ) |   const
Returns
Checks if the port has connection to another port.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PortBase::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetHeight()
 void ACAPI::MEP::v1::PortBase::SetHeight  |  ( |  double  |  height | )
Sets the height of the port.
Parameters
height | The value to be set.
◆ SetMEPSystem()
 void ACAPI::MEP::v1::PortBase::SetMEPSystem  |  ( |  const API_AttributeIndex &  |  attributeIndex | )
Sets the MEPSystem attribute of a Port.
Parameters
attributeIndex | The MEPSystem AttributeIndex to be set.
◆ SetShape()
 void ACAPI::MEP::v1::PortBase::SetShape  |  ( |  ConnectorShape  |  shape | )
Sets the shape of the port.
Parameters
shape | The shape to be set.
◆ SetWidth()
 void ACAPI::MEP::v1::PortBase::SetWidth  |  ( |  double  |  width | )
Sets the width of the port.
Parameters
width | The value to be set.